Revit 2027 API
AreaBasedLoadBoundaryLineData.IsElevationWithinRange Method
 Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElevationWithinRange(
	double elev
)
Public Function IsElevationWithinRange (
	elev As Double
) As Boolean
public:
bool IsElevationWithinRange(
	double elev
)
member IsElevationWithinRange :
        elev : float -> bool
Parameters
elev Double
 The elevation value.
Return Value
Boolean
 True if given elevation is between the bottom level elevation and the top level elevation, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The given value for elev is not a number -or- The given value for elev is not finite
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace